app/views/users/index.html.erb

        <td>
         Total No of Users: <%= User.count %>
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` WHERE (name like '%')

       <td>
        Total No of Users with image: <%= User.count(:image) %>
---
SELECT COUNT(`users`.`image`) FROM `users`

  No of users with name Ashish:
  <%= User.where(name: 'Ashish').count %><br>
---
SELECT COUNT(*) FROM `users` WHERE `users`.`name` = 'Ashish'