app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name like '%')
---
  def index
    @users = User.all

INSERT INTO `users` (`created_at`, `desc`, `email`, `name`, `updated_at`) VALUES ('2014-03-07 05:30:12', 'ninonuibgyu', 'abc', 'Ashish', '2014-03-07 05:30:12')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `image` = 'dashboard.jpg', `updated_at` = '2014-03-07 05:44:42' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)